In [1]:
import pandas as pd
import numpy as np

dict of lists:

In [ ]:
df = pd.DataFrame({
    'ticker': ['AAPL', 'AAPL', 'MSFT', 'IBM', 'YHOO'],
    'date': ['2015-12-30', '2015-12-31', '2015-12-30', '2015-12-30', '2015-12-30'],
    'open': [426.23, 427.81, 42.3, 101.65, 35.53]
})
df

list of dicts:

In [2]:
df = pd.DataFrame([
    {'ticker': 'AAPL', 'date': '2015-12-30', 'open': 426.23},
    {'ticker': 'AAPL', 'date': '2015-12-31', 'open': 427.81},
    {'ticker': 'MSFT', 'open': 42.3, 'date': '2015-12-30'}
])

dataframe from dataframe

In [4]:
pd.DataFrame(df, columns=['ticker', 'date', 'open', 'close'])

  ticker        date    open  close
0   AAPL  2015-12-30  426.23    NaN
1   AAPL  2015-12-31  427.81    NaN
2   MSFT  2015-12-30   42.30    NaN

In [8]:
df.ticker
df['ticker name valami'] = df['ticker']
df['ticker name valami']

0    AAPL
1    AAPL
2    MSFT
Name: ticker name valami, dtype: object

In [9]:
del df['ticker name valami']

In [11]:
df[['ticker', 'open', 'date']]

  ticker    open        date
0   AAPL  426.23  2015-12-30
1   AAPL  427.81  2015-12-31
2   MSFT   42.30  2015-12-30

        row selection

In [16]:
index_ = [True, False, True]
df[index_]

  ticker        date    open
0   AAPL  2015-12-30  426.23
2   MSFT  2015-12-30   42.30

    summary selection
    list[bool] -> rows
    str or list[str] -> columns
    slice -> columns
    dataframe -> cell by cell

    multi axis selection
    EZ loc-KAL TÖRTÉNIK
    row and column indexing

In [20]:
index_ = df.date == '2015-12-30'
df.loc[index_, ['date', 'open', 'ticker']]

         date    open ticker
0  2015-12-30  426.23   AAPL
2  2015-12-30   42.30   MSFT

In [21]:
df

  ticker        date    open
0   AAPL  2015-12-30  426.23
1   AAPL  2015-12-31  427.81
2   MSFT  2015-12-30   42.30

In [24]:
df1 = df.set_index('ticker')
df1

              date    open
ticker
AAPL    2015-12-30  426.23
AAPL    2015-12-31  427.81
MSFT    2015-12-30   42.30

In [30]:
df1.loc[['MSFT'], :] # SAFE VERSION

              date  open
ticker
MSFT    2015-12-30  42.3

In [31]:
df1.loc['MSFT', :] # UNSAFE VERSION

date    2015-12-30
open          42.3
Name: MSFT, dtype: object

    MINDIG DATAFRAMEKENT KÜLDJÜK VISSZA A SOROKAT

In [33]:
df1.loc[['MSFT'], :]

              date  open
ticker
MSFT    2015-12-30  42.3

<h1>Modifying a DataFrame</h1>
    Goals:

    Create a new column close with the same values as open
    Set close to 5000.00 when date == '2015-12-31'

In [37]:
df1a = df1.copy()
df1a['close'] = df1a['open']

df1a.loc[df1a.date == '2015-12-31', 'close'] = 5000
df1a

              date    open    close
ticker
AAPL    2015-12-30  426.23   426.23
AAPL    2015-12-31  427.81  5000.00
MSFT    2015-12-30   42.30    42.30

    Subsets without warnings

    If you want to work with the subset, make a copy:

In [41]:
df2 = df1[df1.date != '2015-12-31'].copy()
df2

              date    open
ticker
AAPL    2015-12-30  426.23
MSFT    2015-12-30   42.30

In [45]:
df2['close'] = 1
df2

              date    open  close
ticker
AAPL    2015-12-30  426.23      1
MSFT    2015-12-30   42.30      1

In [52]:
closes = pd.Series({'AAPL': 430.0, 'MSFT': 43.5, 'SP5': 1263.5})
df2['close'] = closes
df2

              date    open  close
ticker
AAPL    2015-12-30  426.23  430.0
MSFT    2015-12-30   42.30   43.5

In [53]:
x = pd.Series([1, 2, 3, 4, 5], index=list('abcde'))
df2['close'] = x
df2

              date    open  close
ticker
AAPL    2015-12-30  426.23    NaN
MSFT    2015-12-30   42.30    NaN

<h1>sorting

In [54]:
df2.sort_index()

              date    open  close
ticker
AAPL    2015-12-30  426.23    NaN
MSFT    2015-12-30   42.30    NaN

In [57]:
df2.sort_values('open')

              date    open  close
ticker
MSFT    2015-12-30   42.30    NaN
AAPL    2015-12-30  426.23    NaN